Reading Excel File using Pandas in Python
###### CSV (Comma-Separated Values)
##### Excel (XLS / XLSX)
###### CSV stores only raw data in text format, while Excel stores data with formatting, formulas, and multiple sheets.
###### pandas: fast, high-level data analysis
###### openpyxl: fine-grained control of .xlsx files
###### xlwings: connects directly with Excel for automation
### Installation
###### Install the required libraries using the following command:

###### pip install pandas openpyxl xlwings

In [4]:
import pandas as pd

In [8]:
pip install pandas openpyxl xlwings

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: pandas in c:\users\mohap\appdata\roaming\python\python312\site-packages (2.2.2)
Requirement already satisfied: openpyxl in c:\programdata\anaconda3\lib\site-packages (3.1.2)
Requirement already satisfied: xlwings in c:\programdata\anaconda3\lib\site-packages (0.31.4)
Requirement already satisfied: numpy>=1.26.0 in c:\users\mohap\appdata\roaming\python\python312\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\mohap\appdata\roaming\python\python312\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\mohap\appdata\roaming\python\python312\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\mohap\appdata\roaming\python\python312\site-packages (from pandas) (2024.1)
Requirement already satisfied: et-xmlfile in c:\programdata\anaconda3\lib\site-packages (from openpyxl) (1.1.0)
Requirement already satisfied: pywin32>=224 in c:\users\mohap\appdata\roaming\python\python312\site-packages (from xlwings) (308)
Requirement already satisfied: six>=1.5 in c:\users\mohap\appdata\roaming\python\python312\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [10]:
df = pd.read_excel('student_data.xlsx')
print(df)

   Unnamed: 0       Name  Age    Stream  Percentage
0           0      Ankit   18      Math          95
1           1      Rahul   19   Science          90
2           2    Shaurya   20  Commerce          85
3           3  Aishwarya   18      Math          80
4           4   Priyanka   19   Science          75

In [12]:
df.head()

   Unnamed: 0       Name  Age    Stream  Percentage
0           0      Ankit   18      Math          95
1           1      Rahul   19   Science          90
2           2    Shaurya   20  Commerce          85
3           3  Aishwarya   18      Math          80
4           4   Priyanka   19   Science          75

# Using openpyxl
# openpyxl provides low-level access to excel files. It’s useful when you need to work with individual cells, rows, columns, formulas, or formatting.

In [19]:
import  openpyxl
df = openpyxl.load_workbook("student_data.xlsx")
df1 = df.active
for  row in range(0, df1.max_row):
    for col in df1.iter_cols(1,df1.max_column):
        print(col[row].value)

None
Name
Age
Stream
Percentage
0
Ankit
18
Math
95
1
Rahul
19
Science
90
2
Shaurya
20
Commerce
85
3
Aishwarya
18
Math
80
4
Priyanka
19
Science
75

#  Using xlwings
# xlwings connects directly with Microsoft Excel. Unlike pandas or openpyxl, it opens Excel in the background and allows automation such as formatting, formulas, and charts

In [ ]:
import xlwings as xw

# Specifying a sheet
ws = xw.Book("student_data.xlsx").sheets['Sheet1']

v1 = ws.range("B1:B7").value

print("Result:", v1)

Read Text Files with Pandas
Below are the methods by which we can read text files with Pandas:

Using read_csv()
Using read_table()
Using read_fwf()
#####  Read Text Files with Pandas Using read_csv()
##### We will read the text file with pandas using the read_csv() function. Along with the text file, we also pass separator as a single space (‘ ’) for the space character because, for text files, the space character will separate each field. There are three parameters we can pass to the read_csv() function.

### Syntax: 

### Syntax: data=pandas.read_csv('filename.txt', sep=' ', header=None, names=["Column1", "Column2"])

### Parameter:

## filename.txt: As the name suggests it is the name of the text file from which we want to read data.
## sep: It is a separator field. In the text file, we use the space character(' ') as the separator.
## header: This is an optional field. By default, it will take the first line of the text file as a header. If we use header=None then it will create the header.
## names: We can assign column names while importing the text file by using the names argument.

In [1]:
# Read Text Files with Pandas using read_csv()

# importing pandas
import pandas as pd

# read text file into pandas DataFrame
df = pd.read_csv("ratna.txt", sep=" ")

# display DataFrame
print(df)

  Batsman  Bowler
0   Rohit  Bumrah
1   Virat   Suraj
2   Dhoni  Ashwin
3   Raina  Jadeja

In [3]:
# read text file into pandas DataFrame
df = pd.read_csv("ratna.txt", sep=" ",header= None,
                 names=["Team1","Team2"])

# display DataFrame
print(df)

     Team1   Team2
0  Batsman  Bowler
1    Rohit  Bumrah
2    Virat   Suraj
3    Dhoni  Ashwin
4    Raina  Jadeja

Read Text Files with Pandas Using read_table()
We can read data from a text file using read_table() in pandas. This function reads a general delimited file to a DataFrame object. This function is essentially the same as the read_csv() function but with the delimiter = '\t', instead of a comma by default. We will read data with the read_table function making separator equal to a single space(' ').

Syntax: data=pandas.read_table('filename.txt', delimiter = ' ')

Parameters:

filename.txt: As the name suggests it is the name of the text file from which we want to read data.

In [10]:
df = pd.read_table("ratna.txt",delimiter=" ")

# display DataFrame
print(df)

  Batsman  Bowler
0   Rohit  Bumrah
1   Virat   Suraj
2   Dhoni  Ashwin
3   Raina  Jadeja

#### Read Text Files with Pandas Using read_fwf():

###### The fwf in the read_fwf() function stands for fixed-width lines. We can use this function to load DataFrames from files. This function also supports text files. We will read data from the text files using the read_fwf() function with pandas. It also supports optionally iterating or breaking the file into chunks. Since the columns in the text file were separated with a fixed width, this read_fwf() read the contents effectively into separate columns.

## Syntax: data=pandas.read_fwf('filename.txt')

## Parameters:

##### filename.txt: As the name suggests it is the name of the text file from which we want to read data.

In [14]:
df = pd.read_fwf("ratna.txt")

# display DataFrame
print(df)

  Batsman Bowler
0   Rohit Bumrah
1    Virat Suraj
2   Dhoni Ashwin
3   Raina Jadeja

In [16]:
df = pd.read_fwf("mydata.txt")

# display DataFrame
print(df)

         S.NO,NAME,ADDRES,EMAIL,PHONE No.
0      1,Rohan,Balasore,ro2gmail.com,4567
1      2,Ratna,Bhadrak,rt2@gmail.com,3215
2  3,Smruti,Bhubaneswar,Sm@gmail.com,8906

In [20]:
import pandas as pd
df1 =  pd.read_csv("mydata.txt")
df1.to_csv("mydata.csv",index=None)

In [22]:
website = pd.read_csv("ratnadata.txt",header=None)
website.columns = ['Name','Type','Website']
website.to_csv("ratnadata.csv",index=None)

In [24]:
import pandas as pd
import numpy as np

d = {'First Score': [100, 90, np.nan, 95],
        'Second Score': [30, 45, 56, np.nan],
        'Third Score': [np.nan, 40, 80, 98]}
df = pd.DataFrame(d)

mv = df.isnull()

print(mv)

   First Score  Second Score  Third Score
0        False         False         True
1        False         False        False
2         True         False        False
3        False          True        False

In [26]:
import pandas as pd
d = pd.read_csv(r"employees.csv")

bool_series = pd.isnull(d["Gender"])
missing_gender_data = d[bool_series]
print(missing_gender_data)

    First Name Gender  Start Date Last Login Time  Salary  Bonus %  \
20        Lois    NaN   4/22/1995         7:18 PM   64714    4.934
22      Joshua    NaN    3/8/2012         1:58 AM   90816   18.816
27       Scott    NaN   7/11/1991         6:58 PM  122367    5.218
31       Joyce    NaN   2/20/2005         2:40 PM   88657   12.752
41   Christine    NaN   6/28/2015         1:08 AM   66582   11.308
..         ...    ...         ...             ...     ...      ...
961    Antonio    NaN   6/18/1989         9:37 PM  103050    3.050
972     Victor    NaN   7/28/2006         2:49 PM   76381   11.159
985    Stephen    NaN   7/10/1983         8:10 PM   85668    1.909
989     Justin    NaN   2/10/1991         4:58 PM   38344    3.794
995      Henry    NaN  11/23/2014         6:09 AM  132483   16.655

    Senior Management                  Team
20               True                 Legal
22               True       Client Services
27              False                 Legal
31              False               Product
41               True  Business Development
..                ...                   ...
961             False                 Legal
972              True                 Sales
985             False                 Legal
989             False                 Legal
995             False          Distribution

[145 rows x 8 columns]

In [28]:
import pandas as pd
import numpy as np

data = {'Name': ['Amit', 'Sita', np.nan, 'Raj'],
        'Age': [25, np.nan, 22, 28]}

df = pd.DataFrame(data)

# Check for missing values using isna()
print(df.isna())

    Name    Age
0  False  False
1  False   True
2   True  False
3  False  False

In [30]:
import pandas as pd
import numpy as np

d = {'First Score': [100, 90, np.nan, 95],
        'Second Score': [30, 45, 56, np.nan],
        'Third Score': [np.nan, 40, 80, 98]}
df = pd.DataFrame(d)

nmv = df.notnull()

print(nmv)

   First Score  Second Score  Third Score
0         True          True        False
1         True          True         True
2        False          True         True
3         True         False         True

In [32]:
# 2: Filtering Data with Non-Missing Values
import pandas as pd
d = pd.read_csv(r"employees.csv")

nmg = pd.notnull(d["Gender"])

nmgd= d[nmg]

display(nmgd)

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,8/6/1993,12:42 PM,97308,6.945,True,Marketing
1,Thomas,Male,3/31/1996,6:53 AM,61933,4.170,True,NaN
2,Maria,Female,4/23/1993,11:17 AM,130590,11.858,False,Finance
3,Jerry,Male,3/4/2005,1:00 PM,138705,9.340,True,Finance
4,Larry,Male,1/24/1998,4:47 PM,101004,1.389,True,Client Services
...,...,...,...,...,...,...,...,...
994,George,Male,6/21/2013,5:47 PM,98874,4.479,True,Marketing
996,Phillip,Male,1/31/1984,6:30 AM,42392,19.675,False,Finance
997,Russell,Male,5/20/2013,12:39 PM,96914,1.421,False,Product
998,Larry,Male,4/20/2013,4:45 PM,60500,11.985,False,Business Development
999,Albert,Male,5/15/2012,6:24 PM,129949,10.169,True,Sales

In [34]:
# Filling Missing Values in Pandas
import pandas as pd
import numpy as np

d = {'First Score': [100, 90, np.nan, 95],
        'Second Score': [30, 45, 56, np.nan],
        'Third Score': [np.nan, 40, 80, 98]}
df = pd.DataFrame(d)

df.fillna(0)

   First Score  Second Score  Third Score
0        100.0          30.0          0.0
1         90.0          45.0         40.0
2          0.0          56.0         80.0
3         95.0           0.0         98.0

In [36]:
df.fillna(method='pad') # Fill with Previous Value (Forward Fill)

C:\Users\mohap\AppData\Local\Temp\ipykernel_17952\1750536076.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method='pad') # forward fill

   First Score  Second Score  Third Score
0        100.0          30.0          NaN
1         90.0          45.0         40.0
2         90.0          56.0         80.0
3         95.0          56.0         98.0

In [38]:
#Fill with Next Value (Backward Fill)
#The bfill function is used to fill it with the next value.
df.fillna(method='bfill')

C:\Users\mohap\AppData\Local\Temp\ipykernel_17952\2847258919.py:3: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method='bfill')

   First Score  Second Score  Third Score
0        100.0          30.0         40.0
1         90.0          45.0         40.0
2         95.0          56.0         80.0
3         95.0           NaN         98.0

In [40]:
#Fill NaN Values with 'No Gender'
import pandas as pd
import numpy as np
d = pd.read_csv(r"employees.csv")

d[10:25]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
10,Louise,Female,8/12/1980,9:01 AM,63241,15.132,True,NaN
11,Julie,Female,10/26/1997,3:19 PM,102508,12.637,True,Legal
12,Brandon,Male,12/1/1980,1:08 AM,112807,17.492,True,Human Resources
13,Gary,Male,1/27/2008,11:40 PM,109831,5.831,False,Sales
14,Kimberly,Female,1/14/1999,7:13 AM,41426,14.543,True,Finance
15,Lillian,Female,6/5/2016,6:09 AM,59414,1.256,False,Product
16,Jeremy,Male,9/21/2010,5:56 AM,90370,7.369,False,Human Resources
17,Shawn,Male,12/7/1986,7:45 PM,111737,6.414,False,Product
18,Diana,Female,10/23/1981,10:27 AM,132940,19.082,False,Client Services
19,Donna,Female,7/22/2010,3:48 AM,81014,1.894,False,Product
20,Lois,NaN,4/22/1995,7:18 PM,64714,4.934,True,Legal
21,Matthew,Male,9/5/1995,2:12 AM,100612,13.645,False,Marketing
22,Joshua,NaN,3/8/2012,1:58 AM,90816,18.816,True,Client Services
23,NaN,Male,6/14/2012,4:19 PM,125792,5.042,NaN,NaN
24,John,Male,7/1/1992,10:08 PM,97950,13.873,False,Client Services

In [42]:
d["Gender"].fillna('No Gender', inplace = True) 
d[10:25]

C:\Users\mohap\AppData\Local\Temp\ipykernel_17952\1225287812.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  d["Gender"].fillna('No Gender', inplace = True)

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
10,Louise,Female,8/12/1980,9:01 AM,63241,15.132,True,NaN
11,Julie,Female,10/26/1997,3:19 PM,102508,12.637,True,Legal
12,Brandon,Male,12/1/1980,1:08 AM,112807,17.492,True,Human Resources
13,Gary,Male,1/27/2008,11:40 PM,109831,5.831,False,Sales
14,Kimberly,Female,1/14/1999,7:13 AM,41426,14.543,True,Finance
15,Lillian,Female,6/5/2016,6:09 AM,59414,1.256,False,Product
16,Jeremy,Male,9/21/2010,5:56 AM,90370,7.369,False,Human Resources
17,Shawn,Male,12/7/1986,7:45 PM,111737,6.414,False,Product
18,Diana,Female,10/23/1981,10:27 AM,132940,19.082,False,Client Services
19,Donna,Female,7/22/2010,3:48 AM,81014,1.894,False,Product
20,Lois,No Gender,4/22/1995,7:18 PM,64714,4.934,True,Legal
21,Matthew,Male,9/5/1995,2:12 AM,100612,13.645,False,Marketing
22,Joshua,No Gender,3/8/2012,1:58 AM,90816,18.816,True,Client Services
23,NaN,Male,6/14/2012,4:19 PM,125792,5.042,NaN,NaN
24,John,Male,7/1/1992,10:08 PM,97950,13.873,False,Client Services

In [48]:
import pandas as pd
import numpy as np

data = pd.read_csv("employees.csv")
data[10:25]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
10,Louise,Female,8/12/1980,9:01 AM,63241,15.132,True,NaN
11,Julie,Female,10/26/1997,3:19 PM,102508,12.637,True,Legal
12,Brandon,Male,12/1/1980,1:08 AM,112807,17.492,True,Human Resources
13,Gary,Male,1/27/2008,11:40 PM,109831,5.831,False,Sales
14,Kimberly,Female,1/14/1999,7:13 AM,41426,14.543,True,Finance
15,Lillian,Female,6/5/2016,6:09 AM,59414,1.256,False,Product
16,Jeremy,Male,9/21/2010,5:56 AM,90370,7.369,False,Human Resources
17,Shawn,Male,12/7/1986,7:45 PM,111737,6.414,False,Product
18,Diana,Female,10/23/1981,10:27 AM,132940,19.082,False,Client Services
19,Donna,Female,7/22/2010,3:48 AM,81014,1.894,False,Product
20,Lois,NaN,4/22/1995,7:18 PM,64714,4.934,True,Legal
21,Matthew,Male,9/5/1995,2:12 AM,100612,13.645,False,Marketing
22,Joshua,NaN,3/8/2012,1:58 AM,90816,18.816,True,Client Services
23,NaN,Male,6/14/2012,4:19 PM,125792,5.042,NaN,NaN
24,John,Male,7/1/1992,10:08 PM,97950,13.873,False,Client Services

In [50]:
data = data.replace(to_replace=np.nan, value=-99)
print(data[10:25])

   First Name  Gender  Start Date Last Login Time  Salary  Bonus %  \
10     Louise  Female   8/12/1980         9:01 AM   63241   15.132
11      Julie  Female  10/26/1997         3:19 PM  102508   12.637
12    Brandon    Male   12/1/1980         1:08 AM  112807   17.492
13       Gary    Male   1/27/2008        11:40 PM  109831    5.831
14   Kimberly  Female   1/14/1999         7:13 AM   41426   14.543
15    Lillian  Female    6/5/2016         6:09 AM   59414    1.256
16     Jeremy    Male   9/21/2010         5:56 AM   90370    7.369
17      Shawn    Male   12/7/1986         7:45 PM  111737    6.414
18      Diana  Female  10/23/1981        10:27 AM  132940   19.082
19      Donna  Female   7/22/2010         3:48 AM   81014    1.894
20       Lois     -99   4/22/1995         7:18 PM   64714    4.934
21    Matthew    Male    9/5/1995         2:12 AM  100612   13.645
22     Joshua     -99    3/8/2012         1:58 AM   90816   18.816
23        -99    Male   6/14/2012         4:19 PM  125792    5.042
24       John    Male    7/1/1992        10:08 PM   97950   13.873

   Senior Management             Team
10              True              -99
11              True            Legal
12              True  Human Resources
13             False            Sales
14              True          Finance
15             False          Product
16             False  Human Resources
17             False          Product
18             False  Client Services
19             False          Product
20              True            Legal
21             False        Marketing
22              True  Client Services
23               -99              -99
24             False  Client Services

In [52]:
import pandas as pd
   
df = pd.DataFrame({"A": [12, 4, 5, None, 1], 
                   "B": [None, 2, 54, 3, None], 
                   "C": [20, 16, None, 3, 8], 
                   "D": [14, 3, None, None, 6]})  
print(df)

      A     B     C     D
0  12.0   NaN  20.0  14.0
1   4.0   2.0  16.0   3.0
2   5.0  54.0   NaN   NaN
3   NaN   3.0   3.0   NaN
4   1.0   NaN   8.0   6.0

In [54]:
df.interpolate(method ='linear', limit_direction ='forward')

      A     B     C     D
0  12.0   NaN  20.0  14.0
1   4.0   2.0  16.0   3.0
2   5.0  54.0   9.5   4.0
3   3.0   3.0   3.0   5.0
4   1.0   3.0   8.0   6.0

In [56]:
import pandas as pd
import numpy as np

dict = {'First Score': [100, 90, np.nan, 95],
        'Second Score': [30, np.nan, 45, 56],
        'Third Score': [52, 40, 80, 98],
        'Fourth Score': [np.nan, np.nan, np.nan, 65]}
df = pd.DataFrame(dict)

df.dropna()

   First Score  Second Score  Third Score  Fourth Score
3         95.0          56.0           98          65.0

In [58]:
#Dropping Rows with All Null Values
#We can drop rows where all values are missing using dropna(how='all').
dict = {'First Score': [100, np.nan, np.nan, 95],
        'Second Score': [30, np.nan, 45, 56],
        'Third Score': [52, np.nan, 80, 98],
        'Fourth Score': [np.nan, np.nan, np.nan, 65]}
df = pd.DataFrame(dict)

df.dropna(how='all')

   First Score  Second Score  Third Score  Fourth Score
0        100.0          30.0         52.0           NaN
2          NaN          45.0         80.0           NaN
3         95.0          56.0         98.0          65.0

In [64]:
#Dropping Columns with At Least One Null Value
#To remove columns that contain at least one missing value we use dropna(axis=1).
dict = {'First Score': [100, np.nan, np.nan, 95],
        'Second Score': [30, np.nan, 45, 56],
        'Third Score': [52, np.nan, 80, 98],
        'Fourth Score': [60, 67, 68, 65]}
df = pd.DataFrame(dict)

df.dropna(axis=1)

   Fourth Score
0            60
1            67
2            68
3            65

In [66]:
#  Dropping Rows with Missing Values in CSV Files
import pandas as pd
d = pd.read_csv("employees.csv")

nd = d.dropna(axis=0, how='any')

print("Old data frame length:", len(d))
print("New data frame length:", len(nd))
print("Rows with at least one missing value:", (len(d) - len(nd)))

Old data frame length: 1000
New data frame length: 764
Rows with at least one missing value: 236